Autodesk.Revit.DB.BuiltInFailures.RebarFailures.SpliceTypeWasDeleted
Splice type was deleted.

Autodesk.Revit.DB.BuiltInFailures.RebarFailures.RemoveSpliceBetweenBars
Splice cannot be maintained.

Autodesk.Revit.DB.BuiltInFailures.RebarFailures.RebarShapeFailureDueToStaggerOffset
Can't solve Rebar Shape using the exisintg stagger offsets.

Autodesk.Revit.DB.BuiltInFailures.RebarFailures.ConstraintForHandleIsDisabled
The constriant for current handle is disabled.

Autodesk.Revit.DB.BuiltInFailures.RebarFailures.CannotKeepVariabilityOfRebarInGroup
Modifications to the rebar set might cause it to revert to a uniform distribution and reset all disabled constraints. This can occur for layout changes as well as modifications to the geometry.